{
	"@metadata": {
		"authors": [
			"Abijeet Patro",
			"Lucas Werkmeister"
		]
	},
	"tool-name": "The name of the tool. The English name, Ranker, refers to the Wikidata concept of “rank” (compare {{msg-mw|wikibase-diffview-rank}}), and is also a pun (probably untranslatable) on the Rancor, a creature from Star Wars.",
	"skip-to-main-content": "Text for a link that allows users of assistive technologies to skip unimportant parts of the page (the navigation section).",
	"nav-documentation": "Text for a link to the tool’s documentation in its navigation bar / menu.\n{{Identical|Documentation}}",
	"nav-toolforge": "Text for a link to the tool’s hosting platform, Wikimedia Toolforge, in its navigation bar / menu.",
	"nav-source-code": "Text for a link to the tool’s source code in its navigation bar / menu.",
	"nav-login": "Text for a link to log into the tool in its navigation bar / menu.\n{{Identical|Log in}}",
	"nav-logged-in": "Indicator in the navbar that the user is logged in.\n\nParameters:\n* $1 – the user name as a link to the user page.\n* $2 – the user name as plain text. Can be used with the GENDER magic word. If GENDER is not needed, the translation can leave out $2 completely.",
	"index-paragraph-1": "First paragraph on the tool’s index page, describing the tool.",
	"index-label-wiki": "Label for a form input to select the wiki where edits should be made (Wikidata, Wikimedia Commons, or test wikis).",
	"index-option-wikidatawiki": "Label for an option to select editing Wikidata.\n{{Identical|Wikidata}}",
	"index-option-commonswiki": "Label for an option to select editing Wikimedia Commons.\n{{Identical|Wikimedia Commons}}",
	"index-option-testwikidatawiki": "Label for an option to select editing Test Wikidata.",
	"index-option-testcommonswiki": "Label for an option to select editing Test Wikimedia Commons.",
	"index-label-entity-id": "Label for a form input to enter the entity ID to edit. Compare e.g. {{msg-mw|wikibase-listdatavaluetypes-name-wikibase-entityid}}, {{msg-mw|wikibase-api-invalid-entity-id}}, {{msg-mw|apihelp-wbcreateredirect-param-from}}, as well as [[Template:Identical/Entity]].",
	"index-placeholder-entity-id-wikidata": "Placeholder for the entity ID input field when Wikidata (or Test Wikidata) is selected. Must be plain text.\n\nParameters:\n* $1 - example item ID\n* $2 - example property ID\n* $3 - example lexeme ID\n{{Optional}}",
	"index-placeholder-entity-id-commons": "Placeholder for the entity ID input field when Wikimedia Commons (or Test Wikimedia Commons) is selected. Must be plain text.\n\nParameters:\n* $1 - example MediaInfo ID\n* $2 - example file title",
	"index-label-property-id": "Label for a form input to enter the property ID for the statements to edit. Compare e.g. {{msg-mw|wikibase-api-invalid-property-id}}, {{msg-mw|apihelp-wbformatentities-example-3}}, or {{msg-wm|wikidata-image-positions-index-label-property-id-optional}}.",
	"index-button-submit": "Label for a button to submit the form on the index page, showing statements of the selected entity so that the user can select which ones to edit the rank of.",
	"index-batch-heading": "Heading of the batch mode section of the index page.",
	"index-batch-paragraph-1": "First paragraph in the batch mode section of the index page. The different batch mode options are presented as a 2×2 table.",
	"index-batch-col-list": "Header for the table column that lets users select batch modes which operate on a list of statements. (“List” is a verb in this message.)",
	"index-batch-col-query": "Header for the table column that lets users select batch modes which operate on statements selected by a (SPARQL) query. (“Query” is a verb in this message.)",
	"index-batch-row-collective": "Header for the table row that lets users select batch modes which apply the same action for all statements.",
	"index-batch-row-individual": "Header for the table row that lets users select batch modes which can specify a different rank for each statement.",
	"edit-must-log-in": "Message shown on several edit pages when editing is disabled because the user is not logged in.\n\nParameters:\n* $1 - the URL for the login link",
	"edit-paragraph-1-logged-in": "First paragraph on the page to edit the rank of a set of statements, if the user is logged in. (See also {{msg-wm|ranker-edit-paragraph-1-logged-out}} if the user is not logged in.)\n\nParameters:\n* $1 - the number of statements to be edited.\n* $2 - the label of the entity (e.g. a Wikidata item or Wikimedia Commons file) whose statements are being edited.\n* $3 - the label of the Wikidata property selecting the statements to edit (e.g. “instance of”).",
	"edit-paragraph-1-logged-out": "First paragraph on the page to edit the rank of a set of statements, if the user is not logged in. (See also {{msg-wm|ranker-edit-paragraph-1-logged-in}} if the user is logged in.)\n\nParameters:\n* $1 - the number of statements to be edited.\n* $2 - the label of the entity (e.g. a Wikidata item or Wikimedia Commons file) whose statements are being edited.\n* $3 - the label of the Wikidata property selecting the statements to edit (e.g. “instance of”).",
	"edit-select-all": "Label for a button to select all statements.",
	"edit-select-none": "Label for a button to unselect all statements.",
	"edit-invert-selection": "Label for a button to invert the selected statements (select the unselected ones and unselect the selected ones).",
	"edit-noscript": "Hint that is shown on the edit page to users who have JavaScript disabled. The mentioned button labels should match {{msg-wm|ranker-edit-select-all}}, {{msg-wm|ranker-edit-select-none}} and {{msg-wm|ranker-edit-invert-selection}}, but (at least in English) lowercased.",
	"edit-label-summary": "Label for an optional form input to enter a summary for the edit.",
	"edit-button-preferred": "Label for a button to set the rank of the selected statement(s) to preferred ({{msg-mw|wikibase-statementview-rank-preferred}}).",
	"edit-button-normal": "Label for a button to set the rank of the selected statement(s) to normal ({{msg-mw|wikibase-statementview-rank-normal}}).",
	"edit-button-deprecated": "Label for a button to set the rank of the selected statement(s) to deprecated ({{msg-mw|wikibase-statementview-rank-deprecated}}).",
	"edit-button-prominent": "Label for a button to set the rank of the selected statement(s) to prominent ({{msg-mw|wikibasemediainfo-statements-item-mark-as-prominent}}).",
	"edit-button-not-prominent": "Label for a button to set the rank of the selected statement(s) to not prominent (the opposite of {{msg-mw|wikibasemediainfo-statements-item-mark-as-prominent}}).",
	"edit-button-increment": "Label for a button to increment the rank of the selected statement(s), i.e. change normal to preferred and deprecated to normal.",
	"edit-no-statements": "Message shown when the user selected an entity and property ID that had no matching statements.\n\nParameters:\n* $1 - the selected entity (formatted)\n* $2 - the selected property (formatted)",
	"edit-return": "Label for a button shown when the user selected an entity and property ID that had no matching statements, to return to the main page and select different inputs.",
	"batch-list-collective-input": "Label for the input text area on one of the batch pages. Here, the input only contains statement IDs and no other information.",
	"batch-list-individual-input": "Label for the input text area on one of the batch pages. Here, the input contains statement IDs, ranks for those statements, and optional reasons for those ranks. The ranks must be specified as <code>normal</code>, <code>preferred</code> or <code>deprecated</code> (i.e. in English); this shown in the placeholder of the text area, but it might be worth pointing out in translations of this message too.",
	"batch-query-collective-input-wdqs": "Label for the input text area on one of the batch pages. Here, the input is a SPARQL query against the Wikidata Query Service, which should select one variable with a hard-coded name (do not translate <code>?statement</code>).",
	"batch-query-individual-input-wdqs": "Label for the input text area on one of the batch pages. Here, the input is a SPARQL query against the Wikidata Query Service, which should select at least two variables with hard-coded names, and possibly additional variables as well. (Do not translate the variable names.)",
	"batch-individual-button-submit": "Label for a button on some of the batch pages, where the specific actions to take are specified individually for each statement.",
	"batch-list-collective-links": "Message at the bottom of one of the batch pages, linking to another available batch page.\n\nParameters:\n* $1 - URL for the alternative with per-statement rank.",
	"batch-list-collective-links-with-qs": "Version of {{msg-wm|ranker-batch-list-collective-links}} for wikis with a query service, including one more link than before.\n\nParameters:\n* $1 - URL for the alternative with per-statement rank.\n* $2 - URL for the query service version.",
	"batch-list-individual-links": "Message at the bottom of one of the batch pages, linking to another available batch page.\n\nParameters:\n* $1 - URL for the alternative with the same action for each statement.",
	"batch-list-individual-links-with-qs": "Version of {{msg-wm|ranker-batch-list-individual-links}} for wikis with a query service, including one more link than before.\n\nParameters:\n* $1 - URL for the alternative with the same action for each statement.\n* $2 - URL for the query service version.",
	"batch-query-collective-links": "Message at the bottom of one of the batch pages, linking to other available batch pages.\n\nParameters:\n* $1 - URL for the alternative with per-statement rank.\n* $2 - URL for the list version.",
	"batch-query-individual-links": "Message at the bottom of one of the batch pages, linking to other available batch pages.\n\nParameters:\n* $1 - URL for the alternative with the same action for each statement.\n* $2 - URL for the list version.",
	"reason-label-preferred-or-deprecated": "Label for an input field to enter or select a reason for the statement’s rank (on wikis where both preferred and deprecated statements can have a reason assigned).",
	"reason-label-preferred": "Label for an input field to enter or select a reason for the statement’s rank (on wikis where only preferred statements can have a reason assigned).",
	"reason-label-deprecated": "Label for an input field to enter or select a reason for the statement’s rank (on wikis where only deprecated statements can have a reason assigned).",
	"reason-label-optgroup-preferred": "Label for the group of suggested preferred reasons. This is probably not actually shown by any browser, so don’t sweat it about this translation ;)",
	"reason-label-optgroup-deprecated": "Label for the group of suggested deprecation reasons. This is probably not actually shown by any browser, so don’t sweat it about this translation ;)",
	"error-no-such-entity": "Error message shown when the user entered an entity ID that doesn’t exist.\n\nParameters:\n* $1 - the missing entity ID\n* $2 - the selected wiki"
}
