{
	"@metadata": {
		"authors": [
			"Lucas Werkmeister"
		]
	},
	"tool-name": "The name of the tool. The English name, Ranker, refers to the Wikidata concept of “rank” (compare {{msg-mw|wikibase-diffview-rank}}), and is also a pun (probably untranslatable) on the Rancor, a creature from Star Wars.",
	"skip-to-main-content": "Text for a link that allows users of assistive technologies to skip unimportant parts of the page (the navigation section).",
	"nav-documentation": "Text for a link to the tool’s documentation in its navigation bar / menu.\n{{Identical|Documentation}}",
	"nav-toolforge": "Text for a link to the tool’s hosting platform, Wikimedia Toolforge, in its navigation bar / menu.",
	"nav-source-code": "Text for a link to the tool’s source code in its navigation bar / menu.",
	"nav-login": "Text for a link to log into the tool in its navigation bar / menu.\n{{Identical|Log in}}",
	"nav-logged-in": "Indicator in the navbar that the user is logged in.\n\nParameters:\n* $1 – the user name as a link to the user page.\n* $2 – the user name as plain text. Can be used with the GENDER magic word. If GENDER is not needed, the translation can leave out $2 completely.",
	"index-paragraph-1": "First paragraph on the tool’s index page, describing the tool.",
	"edit-paragraph-1-logged-in": "First paragraph on the page to edit the rank of a set of statements, if the user is logged in. (See also {{msg-wm|ranker-edit-paragraph-1-logged-out}} if the user is not logged in.)\n\nParameters:\n* $1 - the number of statements to be edited.\n* $2 - the label of the entity (e.g. a Wikidata item or Wikimedia Commons file) whose statements are being edited.\n* $3 - the label of the Wikidata property selecting the statements to edit (e.g. “instance of”).",
	"edit-paragraph-1-logged-out": "First paragraph on the page to edit the rank of a set of statements, if the user is not logged in. (See also {{msg-wm|ranker-edit-paragraph-1-logged-in}} if the user is logged in.)\n\nParameters:\n* $1 - the number of statements to be edited.\n* $2 - the label of the entity (e.g. a Wikidata item or Wikimedia Commons file) whose statements are being edited.\n* $3 - the label of the Wikidata property selecting the statements to edit (e.g. “instance of”)."
}
